In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('normalized_data.csv')

In [3]:
df

      source    id                                               text
0          0     0  ['12', 'year', 'slave', 'analysi', 'film', 'es...
1          0     1  ['20+', 'social', 'media', 'post', 'idea', 'ra...
2          0     2  ['2022', 'russian', 'invas', 'ukrain', 'global...
3          0     3  ['533', 'u.s.', '27', '2001', 'kyllo', 'v.', '...
4          0     4  ['charl', 'schwab', 'corpor', 'case', 'essay',...
...      ...   ...                                                ...
9995       0  9995  ['workplac', 'stress', 'absente', 'ship-repair...
9996       0  9996  ['world', 'war', 'nation', 'conflict', 'reason...
9997       0  9997  ['xyz', 'compani', 'oper', 'decis', 'present',...
9998       0  9998  ['yahoo', 'compani', 'histori', 'present', 'es...
9999       0  9999  ['zimbabw', 'ufo', 'encount', '1994', 'essay',...

[10000 rows x 3 columns]